<?php
require($_SERVER['DOCUMENT_ROOT'] . '/bitrix/header.php'); ?>
    <h2 id="обо-мне">Обо мне</h2>
    <p>Я Олег. Сейчас руковожу командой <em>крутых инженеров</em> , занимающихся улучшением <em>надежности
            и архитектуры проектов в ПГК</em> .</p>
    <p>В IT я более 10 лет, работал на разных позициях:</p>
    <ul>
        <li>саппорт по битрикс проектам,</li>
        <li>джун\мид\сеньор\техлид по беку,</li>
        <li>фул-стек разработчик,</li>
        <li>devops,</li>
        <li>тимлид,</li>
        <li>руководитель разработки,</li>
    </ul>
    <p>Умею в PHP, Golang, Symfony, Rust, и другие классные слова.</p>
    <h2 id="в-чём-я-крут">В чём я крут?</h2>
    <p>Могу найти общий язык как с <strong>программистами</strong>, так и с <strong>системными администраторами</strong>
        (<strong>девопсами</strong>), и с <strong>менеджерами</strong> / <strong>бизнесом</strong>.</p>
    <p><strong>Более 8 лет</strong> работаю в <strong>распределенных командах</strong> и умею делать работу в них
        эффективной и комфортной. Прошел, через многие команды и понял какие плюсы и минусы есть в каждых командах.
        Обожаю концепт плоской команды, однако понимаю, что не всегда это реализуемо.</p>
    <p>Проектирую, разрабатываю и поддерживаю веб-проекты (<strike>Битрикс порой</strike> на Symfony и на
        GO).</p>
    <p>Как <strong>разработчик</strong> я сделал многие проекты своими руками. Как <strong>лид разработки</strong>
        стараюсь находить на стыке бизнеса и команды разработки баланс и устранять конфликты.</p>
    <p>Со стороны команды занимаюсь <strong>мотивацией</strong>, <strong>обучением</strong>, <strong>развитием</strong>,
        <strong>координацией работы</strong>. Помогаю в составлении ROADMAP для разработчика с учетом его интересов.</p>
    <p>Со стороны бизнеса обсуждаю <strong>требования</strong> , помогаю сформулировать их так, чтобы это было <strong>понятно
            для разработки</strong> . При учете критериев для бизнеса стараюсь использовать <strong>Цикл Деминга (PDCA
            цикл)</strong>. <strong>Декомпозирую</strong> на разумные, последовательные этапы. Оцениваю <strong>трудоемкость</strong>
        и <strong>сроки</strong> . Рассказываю бизнесу потенциальные <strong>риски</strong> . Помогаю находить <strong>альтернативные
            решения</strong> болей заказчика, что позволяет решить проблему бизнеса <strong>быстрее и дешевле</strong>.
    </p>
    <p>В целом могу <strong>фасилитировать</strong> встречи, планерки, ретроспективы. Делаю работу всей команды более
        <strong>прозрачной</strong>, <strong>контролируемой</strong>, <strong>прогнозируемой</strong>.</p>
    <p>Понимаю, почему у бизнеса горят новые фичи, но при этом знаю слова <strong>рефакторинг</strong> и <strong>технический
            долг</strong> . Умею расставить <strong>приоритеты</strong> между этими вещами и объяснить принятые решения.
    </p>
    <p>Работаю ТОЛЬКО на инфраструктуре <strong>Linux</strong>. Считаю, что могу работать с <strong>Ansible</strong> ,
        <strong>Docker</strong> , <strong>Gitlab CI/CD</strong> и т.д. Что не умею - изучаю у Rebrain/</p>
    <p>Могу ставить, принимать и сдавать задачи в <strong>Jira</strong> , <strong>Redmine</strong> ,
        <strong>Youtrack</strong> , и т. д..
        Пишу и обязываю писать других писать документацию в <strong>Confluence</strong> или аналогах.</p>
    <p>Интересуюсь теорией и практикой <strong>информационной безопасности</strong> веб-приложений (но пока больше
        интересуюсь, чем умею).</p>
    <p>Интересуюсь <strong>DevOps</strong> и <strong>SRE</strong>.</p>
    <h2 id="связь-со-мной">Связь со мной</h2>
    <p>Связаться со мной можно по следующим контактным данным. Однако, предпочитаю все вопросы решать по электронной
        почте.</p>
    <p>Почта: <strong><a href="mailto:ol.nizamvov@yandex.ru">ol.nizamvov@yandex.ru</a></strong> (предпочтительный способ
        связи)</p>
    <p>Телеграмм: <strong>@olegnizamov</strong></p>
<?php
require($_SERVER['DOCUMENT_ROOT'] . '/bitrix/footer.php'); ?>